app/Http/Controllers/Auth/RegisteredUserController.php

    public function showRegistrationForm(Request $request, $ref = '' , $lang = '')
    {
        $settings = Utility::settings();

        if($settings['enable_signup'] == 'on')
        {
            $langList = Utility::languages()->toArray();
            $lang = array_key_exists($lang, $langList) ? $lang : 'en';

            if($lang == '')
            {
                $lang = Utility::getValByName('default_language');
            }
            \App::setLocale($lang);
            if($ref == '')
            {
                $ref = 0;
            }

            $refCode = User::where('referral_code' , '=', $ref)->first();
---
select * from `users` where `referral_code` = 0 limit 1