app/Services/AffiliateService.php

    public static function getClickStatistics($affiliateId)
    {
        $clicks = AffiliateLinkClick::where('affiliate_id', $affiliateId)->get();
---
select * from `affiliate_link_clicks` where `affiliate_id` = 8

    public static function getTrafficSourceBreakdown($affiliateId)
    {
        return AffiliateLinkClick::where('affiliate_id', $affiliateId)
            ->selectRaw('traffic_source, COUNT(*) as count')
            ->groupBy('traffic_source')
            ->orderBy('count', 'desc')
            ->get()
            ->pluck('count', 'traffic_source');
---
select traffic_source, COUNT(*) as count from `affiliate_link_clicks` where `affiliate_id` = 8 group by `traffic_source` order by `count` desc

    public static function getTopUTMSources($affiliateId, $limit = 10)
    {
        return AffiliateLinkClick::where('affiliate_id', $affiliateId)
            ->whereNotNull('utm_source')
            ->selectRaw('utm_source, COUNT(*) as count')
            ->groupBy('utm_source')
            ->orderBy('count', 'desc')
            ->limit($limit)
            ->get()
            ->pluck('count', 'utm_source');
---
select utm_source, COUNT(*) as count from `affiliate_link_clicks` where `affiliate_id` = 8 and `utm_source` is not null group by `utm_source` order by `count` desc limit 10