app/Services/DashboardStatsService.php

    public function countCustomers($user)
    {
        return Customer::where('created_by', '=', $user->creatorId())->count();
---
select count(*) as aggregate from `customers` where `created_by` = 2

    public function countVenders($user)
    {
        return Vender::where('created_by', '=', $user->creatorId())->count();
---
select count(*) as aggregate from `venders` where `created_by` = 2

    public function countInvoices($user)
    {
        return Invoice::where('created_by', '=', $user->creatorId())->count();
---
select count(*) as aggregate from `invoices` where `created_by` = 2

    public function countBills($user)
    {
        return Bill::where('created_by', '=', $user->creatorId())->count();
---
select count(*) as aggregate from `bills` where `created_by` = 2

    public function todayIncome($user)
    {
        $revenue = Revenue::where('created_by', '=', $user->creatorId())->whereRaw('Date(date) = CURDATE()')->where('created_by', Auth::user()->creatorId())->sum('amount');
---
select sum(`amount`) as aggregate from `revenues` where `created_by` = 2 and Date(date) = CURDATE() and `created_by` = 2

    public function todayExpense($user)
    {
        $payment = Payment::where('created_by', '=', $user->creatorId())->where('created_by', Auth::user()->creatorId())->whereRaw('Date(date) = CURDATE()')->sum('amount');
---
select sum(`amount`) as aggregate from `payments` where `created_by` = 2 and `created_by` = 2 and Date(date) = CURDATE()

    public function incomeCurrentMonth($user)
    {
        $currentMonth = date('m');
        $revenue = Revenue::where('created_by', '=', $user->creatorId())->whereRaw('MONTH(date) = ?', [$currentMonth])->sum('amount');
---
select sum(`amount`) as aggregate from `revenues` where `created_by` = 2 and MONTH(date) = '12'

    public function expenseCurrentMonth($user)
    {
        $currentMonth = date('m');

        $payment = Payment::where('created_by', '=', $user->creatorId())->whereRaw('MONTH(date) = ?', [$currentMonth])->sum('amount');
---
select sum(`amount`) as aggregate from `payments` where `created_by` = 2 and MONTH(date) = '12'

    public function getincExpBarChartData($user)
    {
        $month[] = __('January');
        $month[] = __('February');
        $month[] = __('March');
        $month[] = __('April');
        $month[] = __('May');
        $month[] = __('June');
        $month[] = __('July');
        $month[] = __('August');
        $month[] = __('September');
        $month[] = __('October');
        $month[] = __('November');
        $month[] = __('December');
        $dataArr['month'] = $month;

        $user_id = Auth::user()->creatorId();
        for ($i = 1; $i <= 12; $i++) {
            $monthlyIncome = Revenue::selectRaw('sum(amount) amount')->where('created_by', '=', $user_id)->whereRaw('year(`date`) = ?', array(date('Y')))->whereRaw('month(`date`) = ?', $i)->first();
            $invoiceTotal = $this->getInvoiceProductsData((date('Y')), $i);

            $totalIncome = (!empty($monthlyIncome) ? $monthlyIncome->amount : 0) + (!empty($invoiceTotal) ? ($invoiceTotal) : 0);

            $incomeArr[] = !empty($totalIncome) ? str_replace(",", "", number_format($totalIncome, 2)) : 0;

            $monthlyExpense = Payment::selectRaw('sum(amount) amount')->where('created_by', '=', $user->creatorId())->whereRaw('year(`date`) = ?', array(date('Y')))->whereRaw('month(`date`) = ?', $i)->first();
---
select sum(amount) amount from `revenues` where `created_by` = 2 and year(`date`) = '2025' and month(`date`) = 1 limit 1
select sum(amount) amount from `payments` where `created_by` = 2 and year(`date`) = '2025' and month(`date`) = 1 limit 1

    public function getIncExpLineChartDate($user)
    {
        $usr = Auth::user();
        $m = date("m");
        $de = date("d");
        $y = date("Y");
        $format = 'Y-m-d';
        $arrDate = [];
        $arrDateFormat = [];

        for ($i = 0; $i <= 15 - 1; $i++) {
            $date = date($format, mktime(0, 0, 0, $m, ($de - $i), $y));

            $arrDay[] = date('D', mktime(0, 0, 0, $m, ($de - $i), $y));
            $arrDate[] = $date;
            $arrDateFormat[] = date("d-M", strtotime($date));
        }
        $dataArr['day'] = $arrDateFormat;
        for ($i = 0; $i < count($arrDate); $i++) {
            $dayIncome = Revenue::selectRaw('sum(amount) amount')->where('created_by', Auth::user()->creatorId())->whereRaw('date = ?', $arrDate[$i])->first();

            $invoiceTotal = $this->getInvoiceProductsData($arrDate[$i]);

            $incomeAmount = (!empty($dayIncome->amount) ? $dayIncome->amount : 0) + (!empty($invoiceTotal) ? ($invoiceTotal) : 0);
            $incomeArr[] = str_replace(",", "", number_format($incomeAmount, 2));

            $dayExpense = Payment::selectRaw('sum(amount) amount')->where('created_by', Auth::user()->creatorId())->whereRaw('date = ?', $arrDate[$i])->first();
---
select sum(amount) amount from `revenues` where `created_by` = 2 and date = '2025-12-23' limit 1
select sum(amount) amount from `payments` where `created_by` = 2 and date = '2025-12-23' limit 1