app/Http/Controllers/AccountantInvitationController.php

select * from `accountant_invitations` where `id` = '2' and `company_id` = 2 and `status` in ('pending', 'accepted') limit 1
---
    public function edit($id)
    {
        if (Auth::user()->type !== 'company') {
            return redirect()->route('dashboard');
        }

        $invitation = AccountantInvitation::where('id', $id)
            ->where('company_id', Auth::id())
            ->whereIn('status', ['pending', 'accepted'])
            ->with('accountant')
            ->firstOrFail();

select * from `accountant_invitations` where `accountant_id` = 8 and `status` = 'accepted' order by `accepted_at` desc limit 15 offset 0
select count(*) as aggregate from `accountant_invitations` where `accountant_id` = 8 and `status` = 'accepted'
---
    public function clients()
    {
        if (Auth::user()->type !== 'accountant') {
            return redirect()->route('dashboard');
        }

        $invitations = AccountantInvitation::where('accountant_id', Auth::id())
            ->where('status', 'accepted')
            ->with('company')
            ->orderBy('accepted_at', 'desc')
            ->paginate(15);