app/Http/Controllers/AccountantMarketplaceController.php

    public function index()
    {
        if (!auth()->check() || auth()->user()->type === 'accountant') {
            return redirect()->route('dashboard');
        }

        // Get all accountants who are available for hire
        $accountants = User::where('type', 'accountant')
            ->where('email_verified_at', '!=', null)
            ->select('id', 'name', 'email', 'avatar', 'created_at', 'experience_years', 'specialties', 'bio')
            ->paginate(12);
---
select `id`, `name`, `email`, `avatar`, `created_at`, `experience_years`, `specialties`, `bio` from `users` where `type` = 'accountant' and `email_verified_at` is not null limit 12 offset 0
select count(*) as aggregate from `users` where `type` = 'accountant' and `email_verified_at` is not null

    public function show($id)
    {
        if (!auth()->check() || auth()->user()->type === 'accountant') {
            return redirect()->route('dashboard');
        }

        $accountant = User::where('type', 'accountant')
            ->where('id', $id)
            ->where('email_verified_at', '!=', null)
            ->firstOrFail();

        // Map bio to description for view compatibility
        $accountant->description = $accountant->bio ?? 'Professional accountant with extensive experience in financial management and compliance.';

        // Parse certifications string into array for view compatibility
        $accountant->certifications = $accountant->certifications
            ? array_map('trim', explode(',', $accountant->certifications))
            : ['Not specified'];

        // Set default values for fields not yet implemented
        $accountant->rating = $accountant->rating ?? number_format(4.5, 1);
        $accountant->review_count = $accountant->review_count ?? 0;
        $accountant->hourly_rate = $accountant->hourly_rate ?? 75;

        // Get accountant's available services
        $services = AccountantService::where('accountant_id', $accountant->id)
            ->where('is_available', true)
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `users` where `type` = 'accountant' and `id` = '8' and `email_verified_at` is not null limit 1
select * from `accountant_services` where `accountant_id` = 8 and `is_available` = 1 order by `created_at` desc

    public function accountantServices()
    {
        if (!auth()->check() || auth()->user()->type !== 'accountant') {
            return redirect()->route('dashboard');
        }

        $services = AccountantService::where('accountant_id', auth()->id())
            ->orderBy('created_at', 'desc')
            ->paginate(10);
---
select * from `accountant_services` where `accountant_id` = 8 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `accountant_services` where `accountant_id` = 8