app/Http/Controllers/DashboardController.php

    public function account_dashboard_index()
    {

        if (Auth::check()) {

            if (Auth::user()->type == 'super admin') {
                return redirect()->route('client.dashboard.view');
            } elseif (Auth::user()->type == 'client') {
                return redirect()->route('client.dashboard.view');
            } elseif (Auth::user()->type == 'accountant') {
                return $this->accountant_dashboard_index();
            } else {
                // Check if this is an accountant impersonating a company
                if (session('accountant_impersonating')) {
                    return $this->accountant_impersonation_dashboard();
                }

                if (\Auth::user()->can('show account dashboard')) {
                    $data['latestIncome'] = Revenue::with(['customer'])->where('created_by', '=', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
                    $data['latestExpense'] = Payment::with(['vender'])->where('created_by', '=', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
                    $currentYer = date('Y');

                    $incomeCategory = ProductServiceCategory::where('created_by', '=', \Auth::user()->creatorId())
                        ->where('type', '=', 'income')->get();
---
select * from `revenues` where `created_by` = 2 order by `id` desc limit 5
select * from `payments` where `created_by` = 2 order by `id` desc limit 5
select * from `product_service_categories` where `created_by` = 2 and `type` = 'income'

                    $data['incomeCategory'] = $inCategory;
                    $data['incomeCatAmount'] = $inAmount;

                    $expenseCategory = ProductServiceCategory::where('created_by', '=', \Auth::user()->creatorId())
                        ->where('type', '=', 'expense')->get();
---
select * from `product_service_categories` where `created_by` = 2 and `type` = 'expense'

                    $data['currentYear'] = date('Y');
                    $data['currentMonth'] = date('M');

                    $constant['taxes'] = Tax::where('created_by', \Auth::user()->creatorId())->count();
                    $constant['category'] = ProductServiceCategory::where('created_by', \Auth::user()->creatorId())->count();
                    $constant['units'] = ProductServiceUnit::where('created_by', \Auth::user()->creatorId())->count();
                    $constant['bankAccount'] = BankAccount::where('created_by', \Auth::user()->creatorId())->count();
                    $data['constant'] = $constant;
                    $data['bankAccountDetail'] = BankAccount::where('created_by', '=', \Auth::user()->creatorId())->limit(5)->get();
                    $data['recentInvoice'] = Invoice::join('customers', 'invoices.customer_id', '=', 'customers.id')
                        ->where('invoices.created_by', '=', \Auth::user()->creatorId())
                        ->orderBy('invoices.id', 'desc')
                        ->limit(5)
                        ->select('invoices.*', 'customers.name as customer_name')
                        ->get();

                    $data['weeklyInvoice'] = \Auth::user()->weeklyInvoice();
                    $data['monthlyInvoice'] = \Auth::user()->monthlyInvoice();
                    $data['recentBill'] = Bill::join('venders', 'bills.vender_id', '=', 'venders.id')
                    ->where('bills.created_by', '=', \Auth::user()->creatorId())
                    ->orderBy('bills.id', 'desc')
                    ->limit(5)
                    ->select('bills.*', 'venders.name as vender_name')
                    ->get();

                    $data['weeklyBill'] = \Auth::user()->weeklyBill();
                    $data['monthlyBill'] = \Auth::user()->monthlyBill();
                    $data['goals'] = Goal::where('created_by', '=', \Auth::user()->creatorId())->where('is_display', 1)->get();

                    //Storage limit
                    $data['users'] = User::find(\Auth::user()->creatorId());
---
select count(*) as aggregate from `taxes` where `created_by` = 2
select count(*) as aggregate from `product_service_categories` where `created_by` = 2
select count(*) as aggregate from `product_service_units` where `created_by` = 2
select count(*) as aggregate from `bank_accounts` where `created_by` = 2
select * from `bank_accounts` where `created_by` = 2 limit 5
select `invoices`.*, `customers`.`name` as `customer_name` from `invoices` inner join `customers` on `invoices`.`customer_id` = `customers`.`id` where `invoices`.`created_by` = 2 order by `invoices`.`id` desc limit 5
select `bills`.*, `venders`.`name` as `vender_name` from `bills` inner join `venders` on `bills`.`vender_id` = `venders`.`id` where `bills`.`created_by` = 2 order by `bills`.`id` desc limit 5
select * from `goals` where `created_by` = 2 and `is_display` = 1
select * from `users` where `users`.`id` = 2 limit 1

    public function accountant_dashboard_index()
    {
        if (Auth::check()) {
            if (Auth::user()->type == 'accountant') {
                $data = [];

                // Get connected companies (accepted invitations)
                $connectedCompanies = \App\Models\AccountantInvitation::where('accountant_id', Auth::id())
                    ->where('status', 'accepted')
                    ->with('company')
                    ->get();

                $data['total_companies'] = $connectedCompanies->count();
                $data['pending_invitations'] = \App\Models\AccountantInvitation::where('accountant_id', Auth::id())
                    ->where('status', 'pending')
                    ->count();
---
select * from `accountant_invitations` where `accountant_id` = 8 and `status` = 'accepted'
select count(*) as aggregate from `accountant_invitations` where `accountant_id` = 8 and `status` = 'pending'

    public function accountant_impersonation_dashboard()
    {
        if (Auth::check() && session('accountant_impersonating')) {
            // Show only accounting-related data for impersonated accountant
            $data = [];

            // Financial data - same as regular accounting dashboard but restricted
            $data['latestIncome'] = Revenue::with(['customer'])->where('created_by', '=', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
            $data['latestExpense'] = Payment::with(['vender'])->where('created_by', '=', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();

            $incomeCategory = ProductServiceCategory::where('created_by', '=', \Auth::user()->creatorId())
                ->where('type', '=', 'income')->get();

            $inColor = array();
            $inCategory = array();
            $inAmount = array();
            for ($i = 0; $i < count($incomeCategory); $i++) {
                $inColor[] = '#' . $incomeCategory[$i]->color;
                $inCategory[] = $incomeCategory[$i]->name;
                $inAmount[] = $incomeCategory[$i]->incomeCategoryRevenueAmount();
            }

            $data['incomeCategoryColor'] = $inColor;
            $data['incomeCategory'] = $inCategory;
            $data['incomeCatAmount'] = $inAmount;

            $expenseCategory = ProductServiceCategory::where('created_by', '=', \Auth::user()->creatorId())
                ->where('type', '=', 'expense')->get();
---
select * from `revenues` where `created_by` = 2 order by `id` desc limit 5
select * from `payments` where `created_by` = 2 order by `id` desc limit 5
select * from `product_service_categories` where `created_by` = 2 and `type` = 'income'
select * from `product_service_categories` where `created_by` = 2 and `type` = 'expense'

            $data['currentMonth'] = date('M');

            // Accounting setup counts only
            $constant['taxes'] = Tax::where('created_by', \Auth::user()->creatorId())->count();
            $constant['category'] = ProductServiceCategory::where('created_by', \Auth::user()->creatorId())->count();
            $constant['units'] = ProductServiceUnit::where('created_by', \Auth::user()->creatorId())->count();
            $constant['bankAccount'] = BankAccount::where('created_by', \Auth::user()->creatorId())->count();
            $data['constant'] = $constant;

            $data['bankAccountDetail'] = BankAccount::where('created_by', '=', \Auth::user()->creatorId())->limit(5)->get();

            // Recent invoices and bills
            $data['recentInvoice'] = Invoice::join('customers', 'invoices.customer_id', '=', 'customers.id')
                ->where('invoices.created_by', '=', \Auth::user()->creatorId())
                ->orderBy('invoices.id', 'desc')
                ->limit(5)
                ->select('invoices.*', 'customers.name as customer_name')
                ->get();
---
select count(*) as aggregate from `taxes` where `created_by` = 2
select count(*) as aggregate from `product_service_categories` where `created_by` = 2
select count(*) as aggregate from `product_service_units` where `created_by` = 2
select count(*) as aggregate from `bank_accounts` where `created_by` = 2
select * from `bank_accounts` where `created_by` = 2 limit 5
select `invoices`.*, `customers`.`name` as `customer_name` from `invoices` inner join `customers` on `invoices`.`customer_id` = `customers`.`id` where `invoices`.`created_by` = 2 order by `invoices`.`id` desc limit 5

            $data['weeklyInvoice'] = \Auth::user()->weeklyInvoice();
            $data['monthlyInvoice'] = \Auth::user()->monthlyInvoice();

            $data['recentBill'] = Bill::join('venders', 'bills.vender_id', '=', 'venders.id')
                ->where('bills.created_by', '=', \Auth::user()->creatorId())
                ->orderBy('bills.id', 'desc')
                ->limit(5)
                ->select('bills.*', 'venders.name as vender_name')
                ->get();
---
select `bills`.*, `venders`.`name` as `vender_name` from `bills` inner join `venders` on `bills`.`vender_id` = `venders`.`id` where `bills`.`created_by` = 2 order by `bills`.`id` desc limit 5