app/Http/Controllers/ReferralProgramController.php

select * from `referral_settings` where `created_by` = 8 limit 1
select * from `transaction_orders` where `status` = 1
select * from `referral_transactions`
---
    public function index()
    {
        if (\Auth::user()->type == 'accountant') {
            // Show accountant-specific referral dashboard
            return $this->accountantIndex();
        }

        $setting = ReferralSetting::where('created_by',\Auth::user()->id)->first();
        $payRequests = TransactionOrder::where('status' , 1)->get();

        $transactions = ReferralTransaction::get();

select * from `referral_settings` where `created_by` = 1 limit 1
select * from `affiliate_referrals` where `affiliate_id` = 2
select * from `transaction_orders` where `req_user_id` = 2
select sum(`commission_amount`) as aggregate from `affiliate_referrals` where `affiliate_id` = 2
select sum(`commission_amount`) as aggregate from `affiliate_referrals` where `affiliate_id` = 2 and `status` = 'registered'
select sum(`commission_amount`) as aggregate from `affiliate_referrals` where `affiliate_id` = 2 and `status` = 'paid'
select * from `transaction_orders` where `status` = 1 and `req_user_id` = 2 limit 1
---
    public function companyIndex()
    {
        $setting = ReferralSetting::where('created_by',1)->first();

        $objUser = \Auth::user();

        $referrals = AffiliateReferral::where('affiliate_id', $objUser->id)->with(['referredUser'])->get();

        $transactionsOrder = TransactionOrder::where('req_user_id',$objUser->id)->get();
        $paidAmount = $transactionsOrder->where('status' , 2)->sum('req_amount');

        $totalCommission = AffiliateReferral::where('affiliate_id', $objUser->id)->sum('commission_amount');
        $pendingCommission = AffiliateReferral::where('affiliate_id', $objUser->id)->where('status', 'registered')->sum('commission_amount');
        $earnedCommission = AffiliateReferral::where('affiliate_id', $objUser->id)->where('status', 'paid')->sum('commission_amount');

        $affiliateLink = url('/register?ref=' . $objUser->referral_code);

        // Get click statistics
        $clickStats = AffiliateService::getClickStatistics($objUser->id);
        $trafficSources = AffiliateService::getTrafficSourceBreakdown($objUser->id);
        $topUTMSources = AffiliateService::getTopUTMSources($objUser->id);

        $paymentRequest = TransactionOrder::where('status' , 1)->where('req_user_id',$objUser->id)->first();