app/Http/Controllers/UserController.php

select * from `users` where `users`.`id` = '2' limit 1
select * from `roles` where `name` = 'accountant-limited' limit 1
---
    public function LoginWithCompany(Request $request, User $user, $id)
    {
        $user = User::find($id);
        if ($user && auth()->check()) {
            // Check if current user is an accountant
            if (auth()->user()->type === 'accountant') {
                // Assign limited accountant role for company access
                $accountantRole = Role::where('name', 'accountant-limited')->first();